#+title: Investments
#+roam_tags: 

*** Price Calculator
Plug in your price into the first column, and the amount of pips in the 2nd
column.
#+NAME: pricecalc
| PAIR   | PIPS Earnings | PIPS Losses |  PRICE |  Units |    Profit |    Losses | Risk/Reward Ratio |
|--------+---------------+-------------+--------+--------+-----------+-----------+-------------------|
| NZDCAD |           100 |          50 | .86694 | 121298 | 10515809. | 5257904.4 |               0.5 |
| NZDCAD |           300 |         100 | .86694 | 121298 | 31547426. | 10515809. |        0.33333333 |
| EURUSD |           500 |         150 | 1.0325 |  76000 | 39235000. | 11770500. |               0.3 |
#+TBLFM: $6=$2*$5*$4::$7=$3*$5*$4::$8=$3/$2
*** Price Finder
Your pips will be (1) decimal place
|   Entry |  Buy TP |   Buy SL | Sell TP |  Sell SL |
|---------+---------+----------+---------+----------|
| 0.69209 | 0.69509 |  0.69089 | 0.68909 |  0.69329 |
| 122.395 | 122.398 | 122.3938 | 122.392 | 122.3962 |
| 0.86948 | 0.87248 |  0.86828 | 0.86648 |  0.87068 |
#+TBLFM: $2=$1+0.0030::$3=$1-0.0012::$4=$1-0.0030::$5=$1+0.0012

*** Take Profit & Stop Loss
#+name: longprofits
|----------+--------+---------+---------|
| Long TP  | 0.6281 | Profits |  296.00 |
| Long SL  | 0.6239 | Losses  | -124.00 |
| Short TP | 0.6221 | Profits |  296.00 |
| Short SL | 0.6263 | Losses  | -124.00 |
|----------+--------+---------+---------|
#+TBLFM: @1$2=remote(var,@2$1) + 0.0030;%0.4f::@1$4=(remote(var,@2$2) * @1$2) - (remote(var,@2$1) * remote(var,@2$2));%0.2f::@2$2=remote(var,@2$1) - 0.0012;%0.4f::@2$4=(remote(var,@2$2) * @2$2) - (remote(var,@2$1) * remote(var,@2$2));%0.2f::@3$2=remote(var,@2$1) - 0.0030;%0.4f::@3$4=(remote(var,@2$2) * @1$2) - (remote(var,@2$1) * remote(var,@2$2));%0.2f::@4$2=remote(var,@2$1) + 0.0012;%0.4f::@4$4=(remote(var,@2$2) * @2$2) - (remote(var,@2$1) * remote(var,@2$2));%0.2f
** Strategy Planning
:LOGBOOK:
- Note taken on [2019-12-11 Wed 00:21] \\
  An example equation for uncertainty. The 3.4cm is the circumference of the ball.
  0.2cm is the smallest number they can get down to for accuracy.
  Relative uncertainty = (0.2 cm ÷ 3.4 cm) × 100% = 5.9%
  #+BEGIN_SRC python
x = 0.2
y = 3.4

z = (x / y) * 100

return(z)
  #+END_SRC

  #+RESULTS: python_percentage
  : 5.88235294118

    #+BEGIN_SRC elisp
(* 100(/ 0.2 3.4))
  #+END_SRC

  #+RESULTS: lisp_percentage
  : 5.882352941176471

  The value can therefore be quoted as 3.4 cm ± 5.9%.
- Note taken on [2019-12-11 Wed 00:19] \\
  To calculate uncertainty, we could look at volatility of the market subtracted
  from our stop loss to come up with our *uncertain* grey area of where we do not
  know what the market will do, and possibly divide that into the remaining of our
  total gain PIPS to formulate a % of how uncertain that trade is to be a success.
:END:
The idea is *probability*. The probability of getting at least 1 out of 4 wins
is favorable when you use this in conjuction with *trends, indicators, patterns
and economic news*. But this begs the question of *uncertainty* and what are the
chances of it having an impact on our win to loss ratios? I stumbled upon this
[[https://sciencing.com/how-to-calculate-uncertainty-13710219.html][article]] which provided some hard numbers that I am looking for.

Example calculation
#+ATTR_LATEX: :float nil
#+BEGIN_SRC python
vol = 18
loss = 9
gain = 30

final = (gain - vol) / loss

return(final)
#+END_SRC

Ideally we would want a *1:3* win to loss ratio. So out of 4 trades, we can
suffer 3 losses and 1 win but still turn a profit by having our profits higher
than our losses. To find this we will have to run a simple calculation:

#+CAPTION: Calculating gains
| Gaining PIPS | Loosing PIPS | Loss Ratio | Position | Difference $ | % Remainder |
|--------------+--------------+------------+----------+--------------+-------------|
|           30 |            9 |          3 |     1.35 |         4.05 |           3 |
|           30 |            8 |          3 |     1.35 |         8.10 |           6 |
#+TBLFM: $5=($1*1.35)-($2*$3*1.35);%0.2f::$6=$1-($2*$3)

With this example, we can see by setting our limit to 30 pips and stop loss to 9
pips, we can suffer 3 losses which would equate to 27 pips but win at least 1
trade at 30 pips would mean we gained 3 pips. Those 3 pips being $4.05 for the
trade.

This gives us a 25% chance of coming out with a winning, or 1 in 4 chances. To
increase chances we can use our indicators, patterns and economic news. In
addition we should also set trades close to Support & Resistance levels to
either reverse and continue a trend.

The next piece is how to calculate our uncertainty in a trade. So our
uncertainty level is going to be when we don't need what a market is going to
do, when does this happen?
+ When it stalls out
+ In the middle of a trend
+ False Reversals

So how do we measure uncertainty in these areas? Well for stall outs we could
look at the average pip movement for a given pair, minus our target pip goal and
the remainder would be our "uncertain" area of what the market will do.

Once this is set, we can set trades using leverage and adjust unit sizes to
adjust our risk/reward percentages. Example, we place a buy order for 100k units
at 1.35 and sell at 1.38 for a profit of $3,000. In addition, we take 3 losses
for a total of 27 PIPS where we place buy orders at 1.35 and our Stop Limits
close at 1.323 for a loss of $2,700 but would still leave us with a $300 profit.

|  Units | PIPS | Price Entry |   Price Exit |   Profit |
|--------+------+-------------+--------------+----------|
| 100000 |   30 |        1.35 |         1.38 |  3000.00 |
| 100000 |  -27 |        1.35 |        1.323 | -2700.00 |
|--------+------+-------------+--------------+----------|
|        |      |             | Final Profit |     300. |
#+TBLFM: $5=($1*$4)-($1*$3);%0.02f::@4$5=@2$5+@3$5

The next step is figuring out margin levels, and what margins to set trades to
for 4 open trades to ensure all 4 trades will have the same gain/loss numbers.
*** Long Range
#+CAPTION: The Ratio Numbers
| Gaining PIPS | Loosing PIPS | Loss Ratio | Position | Difference $ |
|--------------+--------------+------------+----------+--------------|
|          500 |          200 |          2 |     1.35 |       135.00 |
|          400 |           70 |          5 |     1.35 |        67.50 |
#+TBLFM: $5=($1*1.35)-($2*$3*1.35);%0.2f
*** Mid-Long Range
The idea /probability/ is key to understanding that we *will* lose trades and we
*must* lose trades in order to be succesful. It's inevitable... So it then
raises the question. *How do we trade efficiently out weighing our wins to
losses?*.

#+CAPTION: The Ratio Numbers
| Gaining PIPS | Loosing PIPS | Loss Ratio | Position | Difference $ |
|--------------+--------------+------------+----------+--------------|
|          100 |           50 |          2 |     1.35 |         0.00 |
|          100 |           45 |          2 |     1.35 |        13.50 |
|          100 |           40 |          2 |     1.35 |        27.00 |
|          100 |           39 |          2 |     1.35 |        29.70 |
|          100 |           38 |          2 |     1.35 |        32.40 |
|          100 |           35 |          2 |     1.35 |        40.50 |
|          100 |           30 |          3 |     1.35 |        13.50 |
|          100 |           25 |          4 |     1.35 |         0.00 |
#+TBLFM: $5=($1*1.35)-($2*$3*1.35);%0.2f
*** Mid range
The only issue with this strategy is the 100 pips, which can cause for long
trades at times. We could go for a shorter pip range, but it opens the door to
false positives when we have a volatile market. I think the key here for short
trades will be *multiple indicators* + *check trends* + *economic strength*.
#+CAPTION: Mid Range Ratios
| Gaining PIPS | Loosing PIPS | Loss Ratio | Position | Difference $ |
|--------------+--------------+------------+----------+--------------|
|           60 |           19 |          3 |     1.35 |         4.05 |
|           60 |           18 |          3 |     1.35 |         8.10 |
|           60 |           17 |          3 |     1.35 |        12.15 |
|           60 |           16 |          3 |     1.35 |        16.20 |
|           60 |           15 |          4 |     1.35 |         0.00 |
|           50 |           11 |          4 |     1.35 |         8.10 |
|           50 |           12 |          4 |     1.35 |         2.70 |
|           50 |           13 |          3 |     1.35 |        14.85 |
|           50 |           14 |          3 |     1.35 |        10.80 |
|           50 |           15 |          3 |     1.35 |         6.75 |
|           50 |           16 |          3 |     1.35 |         2.70 |
|           50 |           17 |          2 |     1.35 |        21.60 |
|           50 |           18 |          2 |     1.35 |        18.90 |
|           50 |           19 |          2 |     1.35 |        16.20 |
|           50 |           20 |          2 |     1.35 |        13.50 |
#+TBLFM: $5=($1*1.35)-($2*$3*1.35);%0.2f
*** Low Range
#+CAPTION: Lower PIPS
| Gaining PIPS | Loosing PIPS | Loss Ratio | Position | Difference $ |
|--------------+--------------+------------+----------+--------------|
|           30 |           19 |          1 |     1.35 |        14.85 |
|           30 |           18 |          1 |     1.35 |        16.20 |
|           30 |           17 |          1 |     1.35 |        17.55 |
|           30 |           16 |          1 |     1.35 |        18.90 |
|           30 |           14 |          2 |     1.35 |         2.70 |
|           30 |           13 |          2 |     1.35 |         5.40 |
|           30 |           12 |          2 |     1.35 |         8.10 |
|           30 |           11 |          2 |     1.35 |        10.80 |
|           30 |            9 |          3 |     1.35 |         4.05 |
|           30 |            8 |          3 |     1.35 |         8.10 |
|           30 |            7 |          4 |     1.35 |         2.70 |
|           30 |            4 |          7 |     1.35 |         2.70 |
#+TBLFM: $5=($1*1.35)-($2*$3*1.35);%0.2f
** trade diary
| Date       | Pair   |  Units | Entry Price | Closing Price |     Pips | Earnings |
|------------+--------+--------+-------------+---------------+----------+----------|
| 12/06/2019 | EURGBP |  10000 |     0.84987 |       0.84329 |  0.00658 |    65.80 |
| 12/06/2019 | NZDCAD | 120687 |     0.86942 |       0.86930 |  0.00012 |    14.48 |
| 12/12/2019 | NZDCAD | 121298 |     0.86690 |       0.86848 | -0.00158 |  -191.65 |
| 12/12/2019 | AUDUSD |  54166 |     0.69209 |       0.68907 |  0.00302 |   163.58 |
| 12/12/2019 | EURJPY |  45000 |     122.395 |       122.396 | -0.00100 |   -45.00 |
| 12/12/2019 | GBPCHF |  70000 |     1.32614 |       1.32734 | -0.00120 |   -84.00 |
| 12/13/2019 | EURUSD |  90000 |     1.11840 |       1.11542 |  0.00298 |   268.20 |
| 12/13/2019 | AUDUSD |  65000 |     0.68736 |       0.68713 |  0.00023 |    14.95 |
| 12/13/2019 | GBPAUD |  90000 |     1.94221 |       1.94343 | -0.00122 |  -109.80 |
| 12/13/2019 | GBPAUD |  95003 |     1.94190 |       1.93878 |  0.00312 |   296.41 |
| 12/15/2019 | NZDCHF |  65000 |     0.65014 |       0.64982 |  0.00032 |    20.80 |
| 12/15/2019 | EURCAD |  90000 |     1.46272 |       1.46352 | -0.00080 |   -72.00 |
| 12/16/2019 | EURCAD |  90000 |     1.46948 |       1.46754 |  0.00194 |   174.60 |
| 12/16/2019 | NZDUSD |  65000 |     0.65781 |       0.65730 |  0.00051 |    33.15 |
| 12/16/2019 | NZDUSD |  65000 |     0.65635 |       0.65757 | -0.00122 |   -79.30 |
| 12/17/2019 | EURCAD |  90000 |     1.46380 |       1.46151 |  0.00229 |   206.10 |
| 12/17/2019 | NZDCHF |  65000 |     0.64446 |       0.64568 | -0.00122 |   -79.30 |
| 12/17/2019 | NZDCHF |  95000 |     1.45931 |       1.46021 | -0.00090 |   -85.50 |
|------------+--------+--------+-------------+---------------+----------+----------|
| Total      |        |        |             |               |  0.00000 |   511.52 |
#+TBLFM: $6=$4-$5;%0.5f::$7=($3*$4)-($3*$5);%0.2f::$LR7=vsum(@I..II);%0.2f
